#پروژه بازی Space Invaders

# کتابخانه های استفاده شده:
#- PyGame (برای ساخت رابط گرافیکی و مدیریت صداها)
#- Random (برای ایجاد رفتار تصادفی دشمنان)
#- Math (برای محاسبات ریاضی مربوط به برخوردها)
#- Sys (برای مدیریت خروج از برنامه)
#- Time (برای مدیریت زمان بندی شلیک ها)

# نسخه پایتون:
#- توسعه و تست شده با پایتون 3.10.x


#. اجرای بازی:
   #python main.py

# توجه:
#- فایل های صوتی باید در پوشه audio/
#- فایل های تصویری باید در پوشه images/
#قرار بگیرند

#🛠️ معماری سیستم:
#- برنامه نویسی شی گرا (OOP)
#- مدیریت حالت های مختلف بازی
#- سیستم موج های پیشرونده
#- سیستم امتیازدهی پویا
